pruckebusch/contiki_ezr32lg/cpu/arm/ezr32/dev/adc.c
#include <stdio.h>
#include <stdlib.h>
#include <errno.h>

#include <sys/clock.h>
#include "contiki.h"
#include "adc.h"
#include "em_cmu.h"
#include "em_emu.h"

static volatile uint8_t _u8_conv_complete = 0;

/**************************************************************************//**
 * @brief ADC0 interrupt handler. Simply clears interrupt flag.
 *****************************************************************************/
void ADC0_IRQHandler(void)
{
	/*
	 * _u8_conv_complete = 1;
	 * ADC_IntClear(ADC0, ADC_IF_SINGLE);
	 * */

	uint32_t flags;

	// clear interrupt flags
	flags = ADC_IntGet(ADC0);
	ADC_IntClear(ADC0, flags);

	_u8_conv_complete = 1;
}

uint16_t adc_get_value(uint8_t u8_adc_channel, ADC_Ref_TypeDef adcref)
{
  ADC_InitSingle_TypeDef sInit = ADC_INITSINGLE_DEFAULT;
  uint32_t rawvalue = 0;

  /* Set reference  */
  sInit.reference = adcref;
  sInit.input = u8_adc_channel;
  ADC_InitSingle(ADC0, &sInit);

  _u8_conv_complete = 0;

  ADC_Start(ADC0, adcStartSingle);
  /* Wait in EM1 for ADC to complete */
  EMU_EnterEM1();

  // Make sure it's ADC interrupt
  // TODO : timeout
  while(_u8_conv_complete == 0);

  rawvalue = ADC_DataSingleGet(ADC0);

  return (uint16_t) rawvalue;
}

/**
 * Get internal temperature
 * @return Celsius temperature (in tenth degrees)
 */
int16_t adc_get_inttemp(void)
{
  uint32_t rawvalue = 0;

  float temp;
  /* Factory calibration temperature from device information page. */
  float cal_temp_0 = (float)((DEVINFO->CAL & _DEVINFO_CAL_TEMP_MASK)
                             >> _DEVINFO_CAL_TEMP_SHIFT);

  float cal_value_0 = (float)((DEVINFO->ADC0CAL2
                               & _DEVINFO_ADC0CAL2_TEMP1V25_MASK)
                              >> _DEVINFO_ADC0CAL2_TEMP1V25_SHIFT);

  /* Temperature gradient (from datasheet) */
  float t_grad = -6.27;

  rawvalue = adc_get_value(adcSingleInpTemp, adcRef1V25);

  temp = (cal_temp_0 - ((cal_value_0 - rawvalue)  / t_grad));
  //temp = ((cal_value_0 - rawvalue)  / t_grad);

  return (int16_t)(temp*10);
}

uint16_t adc_get_value_mv(uint8_t u8_adc_channel)
{
  uint32_t rawvalue = 0;

  // First try smaller range (more precise)
  rawvalue = adc_get_value(u8_adc_channel, adcRef1V25);
  // Check for 1V25 overflow
  if(rawvalue <= 0xFF0)
  {
    // 4096 -> 1250mv
    return (uint16_t)(rawvalue * 1250 / 4096);
  }
  else
  {
    // Convert again with higher range
    rawvalue = adc_get_value(u8_adc_channel, adcRef2V5);

    if(rawvalue <= 0xFF0)
    {
      // 4096 -> 2500mV
      return (uint16_t)(rawvalue * 2500 / 4096);
    }
    else
    {
      // Final conversion with maximum range
      rawvalue = adc_get_value(u8_adc_channel, adcRef5VDIFF);
      // 4096 -> 5000mV
      return (uint16_t)(rawvalue * 5000 / 4096);
    }
  }
}

uint32_t adc_get_battery(void) {
	uint32_t vData;

	_u8_conv_complete = false;
	// sample ADC
	ADC_Start(ADC0, adcStartSingle);
	while (!_u8_conv_complete) {
		EMU_EnterEM1();
	}
	vData = ADC_DataSingleGet(ADC0);

	return vData;
}

/*---------------------------------------------------------------------------*/
/**
 * Initialize ADC Module
 */
void adc_init(void) {
	ADC_Init_TypeDef init = ADC_INIT_DEFAULT;
	ADC_InitSingle_TypeDef initSingle = ADC_INITSINGLE_DEFAULT;

	/* Enable ADC clock */
	CMU_ClockEnable(cmuClock_ADC0, true);

	/* Initiate ADC peripheral */
	ADC_Init(ADC0, &init);

	/* Setup single conversions for internal VDD/3 */
	initSingle.acqTime = adcAcqTime16;
	initSingle.input = adcSingleInpVDDDiv3;
	ADC_InitSingle(ADC0, &initSingle);

	/* Manually set some calibration values */
	ADC0->CAL = (0x7C << _ADC_CAL_SINGLEOFFSET_SHIFT)
			| (0x1F << _ADC_CAL_SINGLEGAIN_SHIFT);

	/* Enable interrupt on completed conversion */
	ADC_IntEnable(ADC0, ADC_IEN_SINGLE);
	NVIC_ClearPendingIRQ(ADC0_IRQn);
	NVIC_EnableIRQ(ADC0_IRQn);
}

/** @} */
